;
; If you have translated the new language file, you can send it to aqiayi@sina.com .
; welcome to visit Baymax Patch toOls website: https://github.com/sicaril/Baymax-Patch-toOls
; If you find that some translated entries need to be corrected, you can update them on github, or email me.

[Info]
;Language name in your own language e.g. Deutsch
LanguageVer = 1.0
Language = American English
CountriesOrRegions = United States
LangId = 0409
Translator = Baymax

;Note to translators:
;Please keep escape sequences like $1, $2, \n, \t, %d, %s, %% unchanged

[BaymaxUi]
; Main UI
1000 = Information
1001 = Target Program:
1002 = Patcher Title:
1003 = Cracker Name:
1004 = Data
1005 = Patch Type:
1006 = Add Entry
1007 = View Entry
1008 = Delete Entry
1009 = Ordinal
1010 = Patch type
1011 = Module name
1012 = Patch data
1013 = Create Patch

; Menu
1100 = Project(&P)
1101 = Tools(&T)
1102 = Options(&O)
1103 = Help(&H)

; Sub0 Menu
1110 = New Patch Project(&N)
1111 = Load Patch Project(&L)
1112 = Save Patch Project(&S)
1113 = Create Hijack Patch(&U)
1114 = Create Inject Patch(&I)
1115 = Create Hijack Debug Patch(&D)
1116 = Create Inject Debug Patch(&P)
1117 = Exit(&X)

; Sub2 Menu
1130 = Protect Hardware breakpoints(&P)
1131 = Do not break at OEP(&O)
1132 = Patch contains invalid entry(&U)
1133 = Maximum 5 searches for invalid entries(&F)
1134 = Custom patch DLL timing(&M)
1135 = Software breakpoint mode(&I)
1136 = Simulated single-step Mode(single-threaded)
1137 = Simulated single-step Mode II(Single-threaded)
1138 = Simulated HOOK mode(Support multi-threading)
1139 = Hardware Breakpoint Mode(&B)
1140 = Set on current thread(other threads do not set the breakpoint)
1141 = Set on all threads(set Hardware breakpoints on all threads)
1142 = Loader mode(&L)
1143 = APC main thread injection(before Oep)
1144 = Automatic loading(When Running to Oep)
1145 = Patch startup without splash screen(&S)
1146 = Language

; Sub3 Menu
1150 = Help Document(&H)
1151 = View Update(&U) 
1152 = Send a Github Star(&S)
1153 = About (&A)

; Popup Menu
1160 = View Item
1161 = Delete Item

; TEXT
1200 = Baymax64 Tips
1201 = Hijack Patch64.exe
1202 = Hijack Debug Patch64.exe
1203 = Inject Patch64.exe
1204 = Inject Debug Patch64.exe
1205 = Baymax Tips
1206 = Hijack Patch.exe
1207 = Hijack Debug Patch.exe
1208 = Inject Patch.exe
1209 = Inject Debug Patch.exe

1210 = Failed to load patch project! if the patch project is of an earlier version, use the latest version to load the patch.
1211 = No patch data found!
1212 = EXE file (*.exe)\0*.exe\0
1213 = New Project
1214 = Do you need to save the current project?
1215 = Do you need to save the patch project before exiting?
1216 = Baymax Disclaimer
1217 = This tool is for technical communication only, do not use for commercial or illegal purposes! \r\n All effects caused by The patch file you created has nothing to do with the author that baymax patch tools! \r\n\r\n When you click OK, you have agreed to the terms.
1218 = This program patch is only for technical study, \r\n please delete within 24 hours after download! \r\n If you like this program please register to purchase.
1219 = The help document does not exist, please download the latest version from the official.
1220 = Failed to open the help document. Please open the “Help.pdf” file from the program directory.
1221 = Add Patch
1222 = Create Patch
1223 = Please set the target program first!
1224 = Patch file created successfully!
1225 = Patch file creation failed!
1226 = Program corrupted, please download the latest version from official!
1227 = This entry contains stored data and is referenced by another entry. Please dereference before deleting it.
1228 = EXE file (*.exe)\0
1229 = BPT file (*.bpt)\0*.bpt\0
1230 = BPT file (*.bpt)\0
1231 = This project contains %d patch entries. Do you need to reset the target program?
1232 = Do you need to save the current project before loading a new project?
1233 = Are you sure you want to delete this patch entry?

[FeatureCodeUi]
; PlugIn Name
666 = Search and Replace Patch

; Main UI
1000 = Search and Replace Patch
1001 = File
1002 = Process:
1003 = Module:
1004 = Target is any process
1005 = Target other module
1006 = Patch after decoding
1007 = Patch data needs to be decoded by the program for judgment
1008 = Set
1009 = Patch address
1010 = Virtual Addr(VA):
1011 = Module Address:
1012 = Compare file
1013 = Feature code search: (Please fill in the feature code data in the raw data, support '??')
1014 = Feature code search
1015 = Export function:
1016 = Patch data
1017 = Raw data:
1018 = Patch data:
1019 = Note:
1020 = Delete
1021 = Edit
1022 = Add
1023 = Cancel
1024 = Save
1025 = Offset Addr(RVA)
1026 = Raw data
1027 = Patch data
1028 = Note

;HookUi
1100 = Timing of patch execution
1101 = No processing required
1102 = Hook API mode
1103 = Select module:
1104 = Export function:
1105 = Set the Breakpoint mode
1106 = Module name:
1107 = Breakpoint address(RVA):
1108 = Dynamic address mode
1109 = Minimum value of space required to contain patch data(HEX) :
1110 = Wait time mode
1111 = Wait milliseconds(DEC):
1112 = Hook Option
1113 = OK
1114 = Cancel

;HookUi Text
1150 = Hook Settings
1151 = Hook setting error
1152 = Module settings error
1153 = API settings error
1154 = RVA value settings error，Please retype the hexadecimal value.
1155 = The space minimum value is set incorrectly, please re-enter the hexadecimal value.
1156 = Waiting milliseconds is set incorrectly, please re-enter the decimal value.
1157 = EXE file(*.exe)\0*.exe\0DLL file(*.dll)\0*.dll\0PE file(*. *)\0*. *\0

;FixItem Ui
1200 = Edit patch entry

;Msg Text
1300 = Hook Settings
1301 = Patch data is not added
1302 = Incorrect data addition
1303 = The raw data was entered incorrectly
1304 = The patch data is incorrectly entered
1305 = The patch address is incorrect

1310 = Are you sure you want to cancel the HOOK option?
1311 = The patch data is not saved. Do you want to close the patch window?
1312 = The data you entered is incorrect. Please verify it before performing operations.
1313 = The patch address is incorrect! The relative virtual address (RVA) data is incorrectly entered.
1314 = The patch address is incorrect! The virtual address (VA) cannot be empty. Please enter the patch address (hexadecimal).
1315 = The patch address is incorrect! The module address cannot be empty. Please enter the address where the module is loaded in memory(hexadecimal).
1316 = The patch address is incorrect! The virtual address (VA)  data is incorrect. Please enter the hexadecimal data.
1317 = The patch address is incorrect! The module address data is incorrect, please enter the hexadecimal data.
1318 = The patch address is incorrect! The virtual address (VA) cannot be less than or equal to the module address and cannot be less than or equal to zero.
1319 = The entered data must be a hexadecimal value(Use the character '??' For wildcards).
1320 = The hexadecimal data must contain an even number of characters.
1321 = Raw data cannot be empty.
1322 = Patch data cannot be empty.
1323 = The raw data format is incorrect. It should be a hexadecimal value.
1324 = The patch data format is incorrect. It should be a hexadecimal value..
1325 = The length of the raw data is inconsistent with the patch data.
1326 = The raw data is incorrect: The entered data must be a hexadecimal value (Use the character '??' For wildcards). 
1327 = The patch data is incorrect: The entered data must be a hexadecimal value (Use the character '??' For wildcards). 
1328 = Function module loading failed!
1329 = Failed to obtain patch data!
1330 = The raw data is the same as the patch data. Please check the data before adding it.

1350 = Do not check "Target other modules"!
1351 = EXE file (*.exe)\0*.exe\0
1352 = DLL file (*.*)\0*.*\0

; PE Check
2000 = File does not exist or failed to load
2001 = This is not a valid PE file
2002 = This is not a valid 32bit PE file
2003 = This is not a valid 32bit Dll file
2004 = This is not a valid 32bit EXE file
2005 = This is not a valid 64bit PE file
2006 = This is not a valid 64bit Dll file
2007 = This is not a valid 64bit EXE file


[BreakPointCodeUi]
; PlugIn Name
666 = Exception Breakpoint Patch

; Main UI
1000 = Exception Breakpoint Patch
1001 = File
1002 = Process:
1003 = Module:
1004 = Target is any process
1005 = Target other module
1006 = Patch after decoding
1007 = Patch data needs to be decoded by the program for judgment
1008 = Set

1009 = Breakpoint address
1010 = Virtual Addr(VA):
1011 = Module Address:
1012 = First byte:
1013 = Feature code data:
1014 = Feature code search
1015 = Offset:
1016 = Export function:
1017 = Offset:
1018 = Modify return value:
1019 = Return Addr Stack Offset:
1020 = Stack adjustment: 

1021 = Patch data
1022 = Patch type:
1023 = Flag register:
1024 = Register:
1025 = Offset:
1026 = Modified value:
1027 = Value type:
1028 = Register:
1029 = Offset:
1030 = Operator
1031 = Name of the variable where patch data is stored
1032 = Patch data:
1033 = Note:
1034 = Frequency:
1035 = Type:
1036 = Conditional breakpoints
1037 = Delete
1038 = Edit
1039 = Add
1040 = Cancel
1041 = Save
1042 = Note: The entered data is in hexadecimal format

1043 = Offset Addr(RVA)
1044 = Raw data
1045 = Patch data
1046 = Note

; HookUi
1100 = Timing of patch execution
1101 = No processing required
1102 = Hook API mode
1103 = Select module:
1104 = Export function:
1105 = Set the breakpoint mode
1106 = Module name:
1107 = Breakpoint address(RVA):
1108 = Dynamic address mode
1109 = Minimum value of space required to contain patch data(HEX) :
1110 = Wait time mode
1111 = Wait milliseconds(DEC):
1112 = Hook Option
1113 = OK
1114 = Cancel

;HookUi Text
1150 = Hook Settings
1151 = Hook setting error
1152 = Module settings error
1153 = API settings error
1154 = RVA value settings error，Please retype the hexadecimal value.
1155 = The space minimum value is set incorrectly, please re-enter the hexadecimal value.
1156 = Waiting milliseconds is set incorrectly, please re-enter the decimal value.
1157 = EXE file(*.exe)\0*.exe\0DLL file(*.dll)\0*.dll\0PE file(*. *)\0*. *\0

; FixItemDlg UI
1200 = Edit patch entry
1201 = Cancel
1202 = Save

1210 = Patch data:
1211 = EIP offset:
1212 = RIP offset:
1213 = Hex length:
1214 = Storage label:
1215 = Register value:
1216 = Description:
1217 = Label data:
1218 = Timeout detection:
1219 = Modified value:
1220 = Storage value:
1221 = The data you captured is:

; MemOffsetDlg Ui
1300 = Target address (Offset data is in hexadecimal format)
1301 = Addressing register:
1302 = The memory to which the register points:
1303 = Example: [ESP+24]+3C. When the addressing register is EXX/RXX, it refers to the stored address
1304 = Transformation
1305 = OK

1310 = Format resolution
1311 = Data error, register not found.
1312 = Data error, register type is not correct.
1313 = Data error, incorrect offset value.
1314 = Data error, [] symbols does not match.
1315 = Data error, string parsing surplus.
1316 = Data error, parsing error.
1317 = Data error, wrong lvalue match.
1318 = Data error, the offset value is missing a sign.

;ConditionDlg Ui
1400 = Conditional Breakpoints
1401 = Frequency:
1402 = Condition settings
1403 = Do not use conditional breakpoints.
1404 = The number of times execution breakpoints:
1405 = Breakpoints type:
1406 = Register:
1407 = Offset:
1408 = Data type:
1409 = Condition:
1410 = Value:
1411 = Custom conditional breakpoint:
1412 = Cancel
1413 = OK

; MsgText
1500 = Set the breakpoints type
1501 = Please set the register type
1502 = Please set the data type
1503 = Please set the condition type
1504 = The value entered in the offset field is incorrect. Please check and modify it.
1505 = Value field input data is incorrect, please check and modify.

1510 = HOOK Settings
1511 = Patch data is not added
1512 = Incorrect data addition
1513 = Incorrect input in the feature code data
1514 = Incorrect input in patch data
1515 = The RVA address is incorrectly entered
1516 = Friendly reminder
1517 = Edit patch entry

1520 = Are you sure you want to cancel the Hook option?
1521 = The patch data is not saved. Do you want to close the current window directly?
1522 = The data you entered is incorrect. Please verify it before operating.
1523 = The patch address is incorrect! The relative virtual address (RVA) data is incorrectly entered.
1524 = The patch address is incorrect! The virtual address (VA) cannot be empty. Please enter the patch address (Hexadecimal).
1525 = The patch address is incorrect! The base address of the module cannot be empty. Please enter the address where the module is loaded in memory (Hexadecimal).
1526 = The patch address is incorrect! The virtual address data is incorrect. Please enter the hexadecimal data.
1527 = The patch address is incorrect! Module address data is incorrect, please enter the hexadecimal data.
1528 = The patch address is incorrect! The virtual address (VA) cannot be less than or equal to the module address and cannot be less than or equal to zero.
1529 = The entered data must be a hexadecimal value (Use the character '??' For wildcards).
1530 = The hexadecimal data must contain an even number of characters.
1531 = Raw data or patch data cannot be empty.
1532 = The Raw data format is incorrect. It should be a hexadecimal value.
1533 = The patch data format is incorrect. It should be a hexadecimal value.
1534 = The length of the Raw data is inconsistent with the patch data.
1535 = The offset value of the feature code data is incorrect. It should be a hexadecimal value.
1536 = The first byte of the patch address is incorrect. Please fill in the hexadecimal value of the byte. If the target module is not packed, enter 0.
1537 = The target module may be packed or the data pointed by the RVA needs to be decoded, you need to enter the first byte of the patch address.
1538 = The target module RVA value is different from the first byte value of the input, Please note module suspected packed or should be Decode after running.
1539 = The patch data item is incorrectly set.
1540 = The patch data is incorrectly entered.
1541 = The function offset value was incorrectly entered.
1542 = The stack offset of the function return address is incorrect, should be DWORD or QWORD byte alignment.
1543 = The Keyword in the Ini file cannot be empty and has a minimum length of one character.
1544 = The patch address is incorrect! The format of the feature code value is: AA BB ?? 
1545 = The stack adjustment value of the function return address is incorrect, should be DWORD or QWORD byte alignment.
1546 = Please select the corresponding register first.
1547 = The storage label of the data type corresponding to the patch data is not found. Please save the label before using it.
1548 = The current storage label is in use. Please use another storage label.
1549 = The flag register is empty, please select the corresponding register first.
1550 = The register is empty. Please select the corresponding register first.
1551 = The modified value type is empty. Please select the corresponding modified value type first.
1552 = The value type is empty. Please select the corresponding value type first.
1553 = The register value was entered incorrectly.
1554 = The register offset is incorrectly set.
1555 = The EIP/RIP offset is incorrectly set.
1556 = The Hex length is incorrect. Enter the HEX length of the patch data (The Hex length is hexadecimal).
1557 = The current storage label is incorrect. the characters of storage label are allowed only letters, numbers, and underscores.
1558 = The label of patch data read from .ini is incorrect, the characters of storage label are allowed only letters, digits, and underscores.
1559 = Function module loading failed!
1560 = This entry contains the storage label %s. Do you want to delete it?
1561 = You have deleted the entry containing the storage label %s. Please modify the label if it is used elsewhere.
1562 = The storage label is incorrect, the storage label is of non-address type or does not exist!
1563 = The patch item contains storage variables and is used by other items. Please unuse them before modifying them.
1564 = When the EIP/RIP offset value is filled with NOP(or 0), the patch module will automatically get the assembly instruction length of the breakpoint address and add EIP/RIP to achieve the effect of skipping this assembly instruction. \r\nWhen offset value is not NOP(or 0), the EIP/RIP offset value is calculated as the target address minus the current address(Please enter a hexadecimal value).
1565 = Modify EIP/RIP description
1566 = No longer displayed
1567 = OK

1570 = Failed to analyze patch entry!
1571 = Uncheck "Target other modules"!
1572 = There is still patch data not added. Do you want to close the current window directly?
1573 = Patch data is not added
1574 = When "Save the current context and modify it when the function returns" is selected, only the "Modify the memory to which the register points" patch type can be selected!
1575 = EXE file (*.exe)\0*.exe\0
1576 = DLL file (*.*)\0*.*\0

; ListCombo
1600 = Modify register
1601 = Modify flag register
1602 = Modify the memory to which the register points
1603 = Modify EIP/RIP
1604 = Memory keymaker
1605 = Stores the address in the assembly instruction
1606 = Modify the memory to which the storage address
1607 = Add anti-debug detection
1608 = Modify the MMX register value

1610 = Custom immediate number
1611 = Current register
1612 = Memory to which the register points
1613 = Use stored data

1620 = Add connector
1621 = Add register value
1622 = Add memory value to which the register points
1623 = Use stored data
1624 = popover displays record information

1630 = Save register
1631 = Save memory to which the register points
1632 = Saves the memory address in the assembly instruction

1640 = Register
1641 = Memory to which the register points

1650 = equal(==)
1651 = unequal(!=)

1660 = equal(==)
1661 = unequal(!=)
1662 = greater than(>)
1663 = Greater than or equal to(>=)
1664 = less than(<)
1665 = Less than or equal to(<=)
1666 = signed greater than(>)
1667 = signed greater than or equal to(>=)
1668 = signed less than(<)
1669 = signed less than or equal to(<=)

; Do not translate BYTE/WORD/DWORD/QWORD
1670 = BYTE
1671 = WORD
1672 = DWORD
1673 = HEX value
1674 = ASCII string
1675 = Delphi string
1676 = Unicode string
1677 = ASCII length
1678 = Delphi length
1679 = Unicode length
1680 = QWORD

; Do not translate BYTE/WORD/DWORD/QWORD
1690 = BYTE
1691 = WORD
1692 = DWORD
1693 = HEX value
1694 = ASCII string
1695 = Delphi string
1696 = Unicode string
1697 = QWORD

; Do not translate BYTE/WORD/DWORD/QWORD
1700 = BYTE
1701 = BYTE(decimal)
1702 = WORD
1703 = WORD(decimal)
1704 = DWORD
1705 = DWORD(decimal)
1706 = DWORD(signed)
1707 = QWORD
1708 = QWORD(decimal)
1709 = QWORD(signed)

; Do not translate BYTE/WORD/DWORD/QWORD
1710 = BYTE
1711 = BYTE(decimal)
1712 = WORD
1713 = WORD(decimal)
1714 = DWORD
1715 = DWORD(decimal)
1716 = DWORD(signed)
1717 = HEX value
1718 = ASCII string
1719 = Delhpi string
1720 = Unicode string
1721 = QWORD
1722 = QWORD(decimal)
1723 = QWORD(signed)

; Assembly instructions can be untranslated
1730 = no participation
1731 = AND
1732 = OR
1733 = XOR
1734 = NOT
1735 = SHL(Logical Left Shift)
1736 = ROL(Loop Left Shift)
1737 = SHR(Logical Right Shift)
1738 = ROR(Loop Right Shift)
1739 = SAR(Shift Arithmetic Right)
1740 = ADD
1741 = SUB
1742 = MUL
1743 = DIV
1744 = MOD

1750 = Once
1751 = Every Time

1760 = Intelligence Breakpoint
1761 = Software Breakpoint(int3)
1762 = Hardware Breakpoint

1770 = Save the current context and modify it when the function returns
1771 = Modify context when the function returns
1772 = The function returns directly after modifying the context

; PE Check
2000 = File does not exist or failed to load
2001 = This is not a valid PE file
2002 = This is not a valid 32bit PE file
2003 = This is not a valid 32bit Dll file
2004 = This is not a valid 32bit EXE file
2005 = This is not a valid 64bit PE file
2006 = This is not a valid 64bit Dll file
2007 = This is not a valid 64bit EXE file


[ComparePeUi]
; PlugIn Name
666 = PE file comparison

; MainUI
1000 = PE File Comparison
1001 = Original File:
1002 = Modify File:
1003 = Reset Base address(HEX) :
1004 = Select all
1005 = Find the difference at 0, total 0 bytes.
1006 = Add Selected
1007 = Compare File

1010 = Relative Virtual Address:
1011 = Virtual Address:
1012 = File Offset Address:
1013 = Raw data:
1014 = Modify data:
1015 = Item Information

1020 = Relative Virtual Address
1021 = Virtual Address
1022 = File Offset Address
1023 = Raw Data
1024 = Modify Data
1025 = Section Information

1030 = Comparison file automatically added
1031 = Failed to open the original file!
1032 = Failed to open the modify file!
1033 = File comparison failed, unknown error!
1034 = Original file and modify file type is different, do not compare!
1035 = Original file and modify file size is different, do not compare!
1036 = Base address data input error, please check and re-match!
1037 = Base address data input error, exceeding PE file Max!
1038 = If the original file is inconsistent with the project file, do not add it.
1039 = Compare the data before adding it.
1040 = There are %d differences found, a total of %d bytes.
1041 = EXE files (*.EXE)\0*.EXE\0DLL files (*.DLL)\0*.DLL\0PE files (*.*)\0*.*\0

; PE Check
2000 = File does not exist or failed to load
2001 = This is not a valid PE file
2002 = This is not a valid 32bit PE file
2003 = This is not a valid 32bit Dll file
2004 = This is not a valid 32bit EXE file
2005 = This is not a valid 64bit PE file
2006 = This is not a valid 64bit Dll file
2007 = This is not a valid 64bit EXE file


[OffsetTransformUi]
; PlugIn Name
666 = Address format conversion

; MainUI
1000 = Address Format Conversion
1001 = Target file:
1002 = Segment Information
1003 = Format conversion
1004 = Type:
1005 = Base address:
1006 = Convert
1007 = FileSize:
1008 = SizeOfImage:

1010 = Relative Virtual Address
1011 = Virtual Address
1012 = File Offset Address
1013 = Raw Byte
1014 = Section information

1020 = Section information
1021 = Virtual Address
1022 = Virtual Size
1023 = Raw Data Offset
1024 = Data Size
1025 = Flags

1030 = The value of %s entered is incorrect, please check and re-enter!
1031 = The relative vrtual address input is wrong, has exceeded the SizeOfImage!
1032 = The vrtual address input is wrong, should be greater than or equal to the ImageBase and smaller than the module memory size!
1033 = The file offset address input is wrong, has exceeded the file size!
1034 = The file offset address exceeds file size, not located in file!
1035 = The base address is entered incorrectly, exceeded maximum PE file size!
1036 = The base address is entered incorrectly, please check and compare again!
1037 = Original file failed to open!
1038 = EXE files (*.EXE)\0*.EXE\0DLL files (*.DLL)\0*.DLL\0PE files (*.*)\0*.*\0

; PE Check
2000 = File does not exist or failed to load
2001 = This is not a valid PE file
2002 = This is not a valid 32bit PE file
2003 = This is not a valid 32bit Dll file
2004 = This is not a valid 32bit EXE file
2005 = This is not a valid 64bit PE file
2006 = This is not a valid 64bit Dll file
2007 = This is not a valid 64bit EXE file


[SearchFeatureUi]
; PlugIn Name
666 = Feature code search

; MainUI
1000 = Feature Code Search
1001 = Target file:
1002 = Feature code:
1003 = Reset Base address(HEX):
1004 = Find 0.
1005 = Search
1006 = Search String

1010 = No.
1011 = Virtual Address
1012 = Relative Virtual Address
1013 = File Offset Address
1014 = Section information
1015 = Flags

1020 = Feature code not found.
1021 = Found %d in total
1022 = Find more than %d
1023 = EXE files (*.EXE)\0*.EXE\0DLL files (*.DLL)\0*.DLL\0PE files (*.*)\0*.*\0
1024 = The feature code data must be a hexadecimal value(support '??').
1025 = The length of the feature code must be an even number.
1026 = The format of the feature code is incorrect! \r\n format: AA BB ?? ?? CC
1027 = The target file is empty. Please select a target file first.
1028 = Failed to open target file!
1029 = Feature code not found!
1030 = The base address is entered incorrectly, exceeded maximum PE file size!
1031 = The base address is entered incorrectly, please check and compare again!
1033 = Please enter the feature code!

1040 = Copy virtual address successfully!
1041 = Failed to copy virtual address!
1042 = Copy relative virtual address successful!
1043 = Failed to copy relative virtual address!
1044 = Copy file offset address successful!
1045 = Failed to copy file offset address!

1050 = Copy Virtual Address(VA)
1051 = Copy Relative Virtual Address(RVA)
1052 = Copy File Offset Address(FOA)

; PE Check
2000 = File does not exist or failed to load
2001 = This is not a valid PE file
2002 = This is not a valid 32bit PE file
2003 = This is not a valid 32bit Dll file
2004 = This is not a valid 32bit EXE file
2005 = This is not a valid 64bit PE file
2006 = This is not a valid 64bit Dll file
2007 = This is not a valid 64bit EXE file


[StringToHexUi]
; PlugIn Name
666 = String to hexadecimal

; MainUI
1000 = String To Hexadecimal
1001 = String Data:
1002 = Hexadecimal Data (left to right in string order, big endian) :
1003 = Conversion
1004 = String conversion failed, possibly because the data is too long.


[PatchUi]
1000 = Program:
1001 = Cracker:
1002 = Date:
1003 = Patch
1004 = Select Release

1010 = Custom release file
1011 = Ordinal
1012 = Module name
1013 = Type
1014 = hijack module
1015 = crack module
1016 = Select all
1017 = Release
1018 = third-party module
1019 = About

1020 = Injection failed! Error code: %d.
1021 = Smart select patch dll timeout, The program may be running or has not found an available hijack dll, Enable Inject mode? \r\n\r\n Friendly reminder: If the program has packed, It is recommended to test after releasing all files manually. \r\n
1022 = File creation failed! The file is occupied by a process. Please close that process before patching. \r\nFile path: %s
1023 = File creation failed! Error code: %d. \r\nFile path: %s
1024 = Failed to write to file! Error  code: %d \r\nFile path: %s
1025 = Patch successful!
1026 = File release failed!
1027 = %d files released successfully!
1028 = The file already exists. Overwrite it? \r\n Target file: %s

